package org.example._HW3;

public class Concatenation {
//    Задание 1
//    Создайте класс Concatenation
//    Создайте две переменные типа String
//    Примените конкатенацию строк и выведите результат в консоль.
//    Скомпилируйте созданную программу.
//    Запустите программу в терминале.

   public static void main(String[] args) {

       String string1 = "Home";
       String string2 = "Work";

       String result = string1 + " " + string2;

       System.out.println(result);
   }
}
